Revit 2027 API
StructuralSectionAnalysisParams.MomentOfInertiaWeakAxis Property
 Moment of Inertia about main weak axis (I).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MomentOfInertiaWeakAxis { get; set; }
Public Property MomentOfInertiaWeakAxis As Double
	Get
	Set
public:
property double MomentOfInertiaWeakAxis {
	double get ();
	void set (double value);
}
member MomentOfInertiaWeakAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace